# -*- coding: utf-8 -*-
# @Time : 2020/6/26 11:15 
# @Author : 永
# @File : province_city.py 
# @Software: PyCharm

province_city = {"北京":["北京"],
                 "上海":["上海"],
  "安徽": ["合肥", "芜湖", "淮南", "蚌埠", "阜阳", "安庆", "巢湖", "滁州", "六安", "铜陵", "淮北", "宣城", "黄山", "宿州", "亳州", "马鞍山", "池州", "广德","桐城", "霍邱", "当涂", "长丰", "怀远", "五河", "固镇", "繁昌", "全椒", "蒙城"],
  "澳门": ["澳门"],
  "重庆": ["重庆", "万州", "涪陵", "綦江", "黔江", "合川", "丰都", "江津", "铜梁", "长寿", "南川", "永川", "大足", "璧山", "潼南"],
  "福建": ["福州", "厦门", "泉州", "莆田", "漳州", "龙岩", "三明", "南平", "宁德", "平潭", "福清", "南安", "龙海", "惠安", "长乐", "石狮", "安溪","连江", "永春", "罗源", "闽清", "永泰", "泉港", "福安", "永安", "德化", "晋江"],
  "广东": ["广州", "深圳", "东莞", "珠海", "中山", "佛山", "惠州", "江门", "汕头", "清远", "肇庆", "阳江", "茂名", "湛江", "梅州", "揭阳", "河源","汕尾", "阳春", "开平", "云浮", "潮州", "韶关", "顺德", "台山", "恩平", "惠东", "龙门", "博罗", "鹤山", "普宁", "新丰", "雷州"],
  "广西": ["南宁", "柳州", "桂林", "玉林", "贵港", "北海", "河池", "百色", "梧州", "贺州", "钦州", "防城港", "来宾", "崇左", "横县", "宾阳", "邕宁", "东兴"],
  "贵州": ["贵阳", "遵义", "黔东南", "安顺", "黔南", "毕节", "铜仁", "六盘水", "黔西南", "开阳", "修文", "清镇"],
  "甘肃": ["兰州", "张掖", "天水", "庆阳", "平凉", "酒泉", "白银", "武威", "金昌", "陇南", "嘉峪关", "定西", "甘南", "临夏", "永登", "榆中"],
  "海南": ["海南", "三亚", "东方", "儋州", "万宁", "文昌", "琼海"],
  "河南": ["郑州", "洛阳", "焦作", "平顶山", "驻马店", "新乡", "南阳", "信阳", "开封", "漯河", "安阳", "商丘", "周口", "许昌", "濮阳", "三门峡", "鹤壁","汝州", "济源", "鄢陵", "禹州", "长葛", "巩义", "新郑", "荥阳", "伊川", "偃师", "中牟", "登封", "新安", "宜阳", "新密", "嵩县", "洛宁","孟津", "汝阳", "邓州", "兰考", "栾川", "永城", "舞钢"],
  "黑龙江": ["哈尔滨", "大庆", "齐齐哈尔", "佳木斯", "鸡西", "双鸭山", "鹤岗", "牡丹江", "绥化", "七台河", "伊春", "黑河", "大兴安岭", "肇东", "宾县", "安达", "五常", "尚志", "巴彦", "依兰", "肇州", "肇源", "海林"],
  "湖北": ["武汉", "宜昌", "襄阳", "荆州", "十堰", "黄冈", "荆门", "随州", "恩施", "孝感", "黄石", "鄂州", "咸宁", "仙桃", "神农架", "天门", "潜江", "当阳", "宜都", "枝江", "汉南", "京山", "钟祥", "老河口", "枣阳", "宜城", "大冶", "安陆"],
  "湖南": ["长沙", "株洲", "衡阳", "岳阳", "湘潭", "常德", "益阳", "永州", "娄底", "邵阳", "怀化", "郴州", "湘西", "张家界", "浏阳", "宁乡", "醴陵", "攸县", "湘乡", "望城", "耒阳", "常宁"],
  "河北": ["石家庄", "唐山", "保定", "沧州", "廊坊", "邢台", "邯郸", "秦皇岛", "衡水", "张家口", "承德", "固安", "涿州", "遵化", "迁安","定州", "辛集", "滦县", "玉田", "晋州", "滦南", "高碑店", "赵县", "无极", "青龙", "乐亭", "迁西", "文安", "新乐", "元氏", "霸州", "昌黎","平山", "武安", "任丘", "深州", "冀州", "三河", "蔚县", "永清", "高阳", "定兴", "涞水"],
  "江苏": ["南京", "苏州", "无锡", "徐州", "常州", "淮安", "扬州", "南通", "盐城", "连云港", "宿迁", "泰州", "镇江", "常熟", "张家港", "昆山", "吴江", ["邳州", "启东", "溧阳", "东台", "泰兴", "兴化", "海门", "如皋", "江都", "新沂", "高邮", "靖江", "太仓", "江阴", "宜兴", "沭阳", "海安"],"如东", "仪征", "金坛", "睢宁", "丰县", "沛县", "句容", "宝应", "高淳", "泉山", "铜山", "阜宁", "姜堰", "玉山", "金湖", "东海","盱眙", "泗洪"],
  "江西": ["南昌", "赣州", "九江", "吉安", "上饶", "萍乡", "鹰潭", "宜春", "景德镇", "抚州", "新余", "瑞金", "进贤", "新建", "丰城", "靖安"],
  "吉林": ["长春", "吉林", "四平", "白山", "白城", "延边", "通化", "松原", "辽源", "农安", "德惠", "榆树", "桦甸", "公主岭"],
  "辽宁": ["沈阳", "大连", "抚顺", "锦州", "鞍山", "葫芦岛", "阜新", "营口", "本溪", "朝阳", "铁岭", "辽阳", "盘锦", "丹东", "普兰店", "瓦房店", "东港", "凤城", "庄河", "新民", "辽中", "法库", "康平", "台安", "海城"],
  "宁夏": ["银川", "石嘴山", "固原", "吴忠", "中卫"],
  "内蒙古": ["呼和浩特", "包头", "赤峰", "鄂尔多斯", "通辽", "乌兰察布", "巴彦淖尔", "阿拉善盟", "海拉尔", "呼伦贝尔", "乌海", "锡林郭勒盟", "兴安盟", "锡林浩特"],
  "青海": ["西宁", "果洛", "黄南", "海西", "海东", "海北", "玉树"],
  "山东": ["济南", "青岛", "淄博", "潍坊", "烟台", "威海", "临沂", "济宁", "滨州", "德州", "东营", "枣庄", "聊城", "泰安", "日照", "菏泽", "章丘", "诸城", "招远", "高密", "寿光", "邹城", "滕州", "新泰", "肥城", "莱州", "邹平", "龙口", "昌邑", "广饶", "安丘", "青州", "临朐", "济阳", "商河", "昌乐", "莱阳", "平阴", "临清", "栖霞", "海阳", "长清", "齐河", "庆云", "蓬莱", "平度"],
  "山西": ["太原", "长治", "运城", "临汾", "晋中", "大同", "忻州", "吕梁", "朔州", "阳泉", "晋城", "临猗", "清徐", "阳曲", "怀仁"],
  "陕西": ["西安", "宝鸡", "咸阳", "渭南", "汉中", "安康", "榆林", "延安", "铜川", "商洛", "蓝田", "户县", "周至", "高陵"],
  "四川": ["成都", "绵阳", "泸州", "南充", "德阳", "乐山", "达州", "广安", "攀枝花", "遂宁", "自贡", "内江", "广元", "巴中", "宜宾", "眉山", "资阳", "雅安", "凉山", "阿坝州", "甘孜", "彭州", "金堂", "邛崃", "简阳", "崇州", "大邑", "都江堰", "新津", "峨眉山"],
  "天津": ["蓟州","天津"],
  "新疆": ["乌鲁木齐", "克拉玛依", "喀什", "巴州", "伊犁", "阿克苏", "博尔塔拉", "昌吉", "哈密", "和田", "克孜勒苏", "石河子", "吐鲁番", "五家渠", "奎屯", "库尔勒"],
  "西藏": ["昌都", "拉萨", "林芝", "那曲", "日喀则"],
  "香港": ["香港"],
  "云南": ["昆明", "红河", "文山", "曲靖", "玉溪", "丽江", "大理", "楚雄", "保山", "昭通", "德宏", "临沧", "西双版纳", "普洱", "迪庆", "怒江", "安宁", "宜良"],
  "浙江": ["杭州", "宁波", "嘉兴", "温州", "金华", "台州", "绍兴", "湖州", "衢州", "丽水", "舟山", "长兴", "德清", "慈溪", "海宁", "温岭", "诸暨", "临海", "余姚", "桐乡", "上虞", "平湖", "宁海", "奉化", "建德", "桐庐", "象山", "玉环", "淳安", "镇海", "海盐", "安吉"]}

# key = "商丘"
# province= None
# data = province_city.keys()
# for i in data:
#     city = province_city[i]
#     for j in city:
#         if key in city:
#             province = i
# print(province)